In [ ]:
"""Find all employees with thier managers, managers exclusive"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists  `dept_emp` ; 
drop table if exists  `dept_manager` ; 

CREATE TABLE `dept_emp` (
`emp_no` int(11) NOT NULL,
`dept_no` char(4) NOT NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`dept_no`));

CREATE TABLE `dept_manager` (
`dept_no` char(4) NOT NULL,
`emp_no` int(11) NOT NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`dept_no`));

INSERT INTO dept_emp VALUES(10001,'d001','1986-06-26','9999-01-01');
INSERT INTO dept_emp VALUES(10002,'d001','1996-08-03','9999-01-01');
INSERT INTO dept_emp VALUES(10003,'d002','1995-12-03','9999-01-01');

INSERT INTO dept_manager VALUES('d001',10002,'1996-08-03','9999-01-01');
INSERT INTO dept_manager VALUES('d002',10003,'1990-08-05','9999-01-01');

In [ ]:
"""SQL solution"""
# 1
SELECT e.emp_no, m.emp_no
FROM dept_emp AS e, dept_manager AS m
WHERE e.dept_no = m.dept_no
AND e.emp_no NOT IN 
(SELECT emp_no FROM dept_manager)

# 2
SELECT e.emp_no, m.emp_no
FROM dept_emp AS e, dept_manager AS m
WHERE e.dept_no = m.dept_no
AND e.emp_no != m.emp_no

In [9]:
"""Pandas dataframe creation"""
import pandas as pd
import numpy as np

t_de = np.array([[10001,'d001','1986-06-26','9999-01-01'],
                 [10002,'d001','1996-08-03','9999-01-01'],
                 [10003,'d002','1995-12-03','9999-01-01']])
t_dm = np.array([['d001',10002,'1996-08-03','9999-01-01'],
                 ['d002',10003,'1990-08-05','9999-01-01']])

dept_emp = pd.DataFrame(data=t_de, columns=['emp_no', 'dept_no', 'from_date', 'to_date'])
dept_manager = pd.DataFrame(data=t_dm, columns=['dept_no', 'emp_no', 'from_date', 'to_date'])
dept_emp.head()

  emp_no dept_no   from_date     to_date
0  10001    d001  1986-06-26  9999-01-01
1  10002    d001  1996-08-03  9999-01-01
2  10003    d002  1995-12-03  9999-01-01

In [7]:
dept_manager.head()

  dept_no emp_no   from_date     to_date
0    d001  10002  1996-08-03  9999-01-01
1    d002  10003  1990-08-05  9999-01-01

In [25]:
# merge the two table
emp_manager = pd.merge(dept_emp, dept_manager, on='dept_no', how='outer')
emp_manager

  emp_no_x dept_no from_date_x   to_date_x emp_no_y from_date_y   to_date_y
0    10001    d001  1986-06-26  9999-01-01    10002  1996-08-03  9999-01-01
1    10002    d001  1996-08-03  9999-01-01    10002  1996-08-03  9999-01-01
2    10003    d002  1995-12-03  9999-01-01    10003  1990-08-05  9999-01-01

In [26]:
# exclude the managers
emp_manager = emp_manager[emp_manager.emp_no_x != emp_manager.emp_no_y]
# select only the emp_no of employees and managers
emp_manager = emp_manager.loc[:,['emp_no_x', 'emp_no_y']]
# rename the columns
emp_manager = emp_manager.rename(columns={'emp_no_x': 'emp', 'emp_no_y': 'manager'})
emp_manager

     emp manager
0  10001   10002